# AreElementsValidIntersectingReferences Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..AreElementsValidIntersectingReferences Method
PartMakerMethodToDivideVolumes Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreElementsValidIntersectingReferences(ICollection<(Of <<'(ElementId>)>>)) | Identifies if provided members are valid. |
| AreElementsValidIntersectingReferences(Document, ICollection<(Of <<'(ElementId>)>>)) | Identifies if provided members are valid. |

# See Also
PartMakerMethodToDivideVolumes Class
PartMakerMethodToDivideVolumes Members
Autodesk.Revit.DB Namespace